import Mock from 'mockjs'
export default {
  'member|1000000-8000000': 1,
  'memberForm|3': [
    {
      'name|+1': [
        '原户籍',
        '外来务工人员',
        '新户籍'
      ],
      'value|100000-900000': 1
    }
  ],
  'ageDivide|6': [
    {
      'name|+1': [
        '18岁以下',
        '18~30岁',
        '30~40岁',
        '40~50岁',
        '50~60岁',
        '60岁以上',
      ],
      'value|100000-900000': 1
    }
  ],
  'gdp|5': [
    {
      'name|+1': [
        '2016年',
        '2017年',
        '2018年',
        '2019年',
        '2020年',
      ],
      'value|100000-900000': 1
    }
  ]
}